/*
Завдання 3.
3.1  
На змаганнях з паверліфтингу використовуються дискові навантажувачі вагою 0.5, 1, 2.5, 5, 10, 15, 20 та 25 кг. 
Також ми маємо американські дискові навантажувачі вагу яких визначено у lbs. Такі  дискові навантажувачі є тільки в 10, 25, 35, 45 фунтів. 
Гриф на штанзі завжди один і дорівнює 20кг. 

Потрібно знайти таку комбінацію дисковихі навантажувачів, щоб вага на штанзі була мінімальною, але перевищувала максимальний рекорд. 
Наприклад, Спортсмен номер 1 підняв 101 кг використовуючи гриф 20кг, 4 дискових навантажувачі по 20 кг та два по 0.5. 
Для того щоб перевершити вагу попереднього спортсмена, Спортсмену номер 2 буде оптимально підняти 101.44 які можна отримати з грифу 
20 кг і двох дискових навантажувачів наступних найменувань  1, 2.5, 10, кг та 25, 35 lbs.

Треба написати програму, яка за заданою вагою буде знаходити мінімальний наступний.

! Важливо, що  дискові навантажувачі будь-якої ваги вішаються на штангу попарно. Так само на штанзі може бути 
не більше 24 дискових  навантажувачі, тобто максимум 12 з кожного боку.
 */
let top_weight = 101;
let weight = (top_weight - 20) ; // 81kg

// 10lbs = 4.53kg; 25lbs=11.34kg; 35lbs = 15.87kg; 45lbs = 20.41kg
let blin = [0.5, 1, 2.5, 5, 10, 20, 25, 4.53, 11.34, 15.87, 20.41];
blin = blin.map(el=>el*2)
console.log(blin);